In [1]:
import pandas as pd

In [3]:
pd.__version__

'1.5.3'

In [4]:
data = {
    "names":['a','b','c'],
    "ages":[25,28,21]
}

In [6]:
df = pd.DataFrame(data)
df

  names  ages
0     a    25
1     b    28
2     c    21

In [7]:
df.head(2)

  names  ages
0     a    25
1     b    28

In [8]:
df.tail(1)

  names  ages
2     c    21

In [10]:
df.describe() #details about integer column

            ages
count   3.000000
mean   24.666667
std     3.511885
min    21.000000
25%    23.000000
50%    25.000000
75%    26.500000
max    28.000000

In [12]:
df.dtypes #tells about the data types of all the columns

names    object
ages      int64
dtype: object

In [13]:
df.info() #technical summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   ages    3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [15]:
df.columns=["Name","Age"]
df

  Name  Age
0    a   25
1    b   28
2    c   21

In [16]:
df2 = df.rename(columns={"Name":"Emp_Name","Age":"Emp_Age"})

In [17]:
df2

  Emp_Name  Emp_Age
0        a       25
1        b       28
2        c       21

In [20]:
dept = ["Sales","Marketing","IT"]
df3=df.assign(Department=dept)

In [21]:
df3.dtypes

Name          object
Age            int64
Department    object
dtype: object

In [22]:
df4=df3.convert_dtypes()

In [24]:
df4.dtypes

Name          string
Age            Int64
Department    string
dtype: object

In [27]:
df5 = df3.astype({"Age":float})

In [28]:
df5.dtypes

Name           object
Age           float64
Department     object
dtype: object

In [30]:
df.shape[0]  #number of rows in the data frame

3

In [31]:
df.shape[1]  #number of columns in the data frame

2

In [32]:
df.shape  #both number of rows and columns

(3, 2)

In [35]:
df.display

AttributeError: 'DataFrame' object has no attribute 'display'

In [38]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }

In [40]:
tech = pd.DataFrame(technologies)
tech

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1200
3   Python  22000   40days      2500
4   pandas  24000   60days      2000

In [41]:
index=['r1','r2','r3','r4','r5']

In [43]:
tech = pd.DataFrame(technologies,index=index)
tech

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [ ]:
#df.loc[start:stop:step,start:stop:step]
#            row           column

In [52]:
tech.loc['r1':'r4']

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500

In [55]:
tech.loc[tech["Fee"]>=2000]

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [60]:
tech.loc['r1':'r4',["Courses"]]

    Courses
r1    Spark
r2  PySpark
r3   Hadoop
r4   Python

In [61]:
tech.drop(columns="Discount")

    Courses    Fee Duration
r1    Spark  20000    30day
r2  PySpark  25000   40days
r3   Hadoop  26000   35days
r4   Python  22000   40days
r5   pandas  24000   60days

In [62]:
emp_df = pd.read_csv("/home/labuser/Desktop/Employee.csv")

In [63]:
emp_df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [64]:
emp_df["Start Date"] = pd.to_datetime(emp_df["Start Date"])

In [65]:
emp_df.dtypes

First Name                   object
Gender                       object
Start Date           datetime64[ns]
Last Login Time              object
Salary                        int64
Bonus %                     float64
Senior Management            object
Team                         object
dtype: object

In [66]:
emp_df.nunique()

First Name           200
Gender                 2
Start Date           972
Last Login Time      720
Salary               995
Bonus %              971
Senior Management      2
Team                  10
dtype: int64

In [67]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 62.6+ KB

In [68]:
emp_df['Gender'].fillna("No Gender",inplace=True)

In [70]:
emp_df['Gender'].value_counts()

Female       431
Male         424
No Gender    145
Name: Gender, dtype: int64

In [74]:
emp_df['Gender'].mode()

0    Female
Name: Gender, dtype: object

In [77]:
emp_df.groupby(['Gender']).count()

,First Name,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
Gender,,,,,,,
Female,400,431,431,431,431,400,418
Male,395,424,424,424,424,395,398
No Gender,138,145,145,145,145,138,141

In [79]:
emp_df['Senior Management'].fillna(emp_df['Senior Management'].mode().iloc[0], inplace = True)